In [1]:
import pandas as pd
d=pd.read_excel("missing.xlsx")
df=pd.DataFrame(d)
print(df)

   S.No.      Name   Eng  Maths   Sci  Total
0      1       ali   NaN   56.0  77.0    133
1      2  nivedita  35.0   66.0  79.0    180
2      3   saksham  36.0    NaN  81.0    117
3      4     sonia  37.0   86.0  83.0    206
4      5      abhi  38.0   96.0   NaN    134
5      6     rahul  39.0    NaN  87.0    126
6      7      abhi  40.0  116.0  89.0    245

In [2]:
df.dropna()

   S.No.      Name   Eng  Maths   Sci  Total
1      2  nivedita  35.0   66.0  79.0    180
3      4     sonia  37.0   86.0  83.0    206
6      7      abhi  40.0  116.0  89.0    245

In [4]:
import pandas as pd
d=pd.read_excel("missing.xlsx")
df=pd.DataFrame(d)
print(df)

   S.No.      Name   Eng  Maths   Sci  Total
0      1       ali   NaN   56.0  77.0    133
1      2  nivedita  35.0   66.0  79.0    180
2      3   saksham  36.0    NaN  81.0    117
3      4     sonia  37.0   86.0  83.0    206
4      5      abhi  38.0   96.0   NaN    134
5      6     rahul  39.0    NaN  87.0    126
6      7      abhi  40.0  116.0  89.0    245

In [5]:
df['Name'].dropna()

0         ali
1    nivedita
2     saksham
3       sonia
4        abhi
5       rahul
6        abhi
Name: Name, dtype: object

In [6]:
import pandas as pd
d=pd.read_excel("missing.xlsx")
df=pd.DataFrame(d)
print(df)

   S.No.      Name   Eng  Maths   Sci  Total
0      1       ali   NaN   56.0  77.0    133
1      2  nivedita  35.0   66.0  79.0    180
2      3   saksham  36.0    NaN  81.0    117
3      4     sonia  37.0   86.0  83.0    206
4      5      abhi  38.0   96.0   NaN    134
5      6     rahul  39.0    NaN  87.0    126
6      7      abhi  40.0  116.0  89.0    245

In [7]:
df.loc[:,['Name','Eng']].dropna()

       Name   Eng
1  nivedita  35.0
2   saksham  36.0
3     sonia  37.0
4      abhi  38.0
5     rahul  39.0
6      abhi  40.0

In [8]:
import pandas as pd
d=pd.read_excel("missing.xlsx")
df=pd.DataFrame(d)
print(df)

   S.No.      Name   Eng  Maths   Sci  Total
0      1       ali   NaN   56.0  77.0    133
1      2  nivedita  35.0   66.0  79.0    180
2      3   saksham  36.0    NaN  81.0    117
3      4     sonia  37.0   86.0  83.0    206
4      5      abhi  38.0   96.0   NaN    134
5      6     rahul  39.0    NaN  87.0    126
6      7      abhi  40.0  116.0  89.0    245

In [9]:
df.fillna("*")

   S.No.      Name   Eng  Maths   Sci  Total
0      1       ali     *   56.0  77.0    133
1      2  nivedita  35.0   66.0  79.0    180
2      3   saksham  36.0      *  81.0    117
3      4     sonia  37.0   86.0  83.0    206
4      5      abhi  38.0   96.0     *    134
5      6     rahul  39.0      *  87.0    126
6      7      abhi  40.0  116.0  89.0    245

In [10]:
df['Eng'].fillna(33)

0    33.0
1    35.0
2    36.0
3    37.0
4    38.0
5    39.0
6    40.0
Name: Eng, dtype: float64